Tekla Open API Reference for Tekla Structures 2025
BoltXYList.GetBoltDistYCount Method
 Returns the amount of Y distances in the bolt XY list.
 Namespace: Tekla.Structures.Model
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public int GetBoltDistYCount()
Public Function GetBoltDistYCount As Integer
Return Value
Type: Int32
The amount of Y distances.
See Also
Reference
BoltXYList Class
Tekla.Structures.Model Namespace